Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: See also the C<perlapio> documentation for more information about the following functions:
es: Vea también la documentación de C<perlapio> para obtener más información acerca de las siguientes funciones:

source: See also:
es: Vea también:

source: See also: "What if I don't encode?".
es: Vea también: "¿Qué pasa si no descodifico?".

source: See also: L<perlre/"Special Backtracking Control Verbs">
es: Vea también: L<perlre/"Verbos especiales para el control de la vuelta atrás">

source: See below for details.
es: Vea los detalles a continuación.

source: See below for more description of the switches.
es: A continuación se muestra una descripción más detallada de los modificadores.

source: See below for more details.>
es: Siga leyendo para obtener más detalles al respecto.>

source: See either L</instance variable> or L</character property>.
es: Vea L</variable de instancia> o L</propiedad de carácter>.

source: See either L<switches|/switch> or L</regular expression modifier>.
es: Vea L<modificadores|/modificador> o L</modificador de expresión regular>.

source: See the L</Writing Accessors> section for details.
es: Encontrará más información en la sección L</Implementación de métodos de acceso>.

source: See the L<glob|perlfunc/glob> function.
es: Vea la función L<glob|perlfunc/glob>.

source: See the previous example.
es: Vea el ejemplo anterior.

source: See the CPAN FAQ at L<http://www.cpan.org/misc/cpan-faq.html> for answers to the most frequently asked questions about CPAN.
es: En la sección FAQ (preguntas más frecuentes) de CPAN (en L<http://www.cpan.org/misc/cpan-faq.html> ) encontrará respuestas a las preguntas más frecuentes sobre CPAN.

source: See the Camel Book for why.
es: Consulte el "Libro del Camello" (en concreto, camello arábigo, o dromedario) para averiguar por qué.

source: See the F<h2ph> documentation for more on how to convert a whole bunch of header files at once.
es: Consulte la documentación de F<h2ph> para obtener más información sobre la manera de convertir varios archivos de encabezado a la vez.

source: See the L<Perl Mongers web site|http://www.pm.org/> for more information about joining, starting, or requesting services for a Perl user group.
es: Visite el L<sitio web de Perl Mongers|http://www.pm.org/> para obtener más información sobre servicios relacionados con los grupos de usuarios de Perl: cómo unirse a un grupo, cómo iniciar un grupo o cómo solicitar servicios para un grupo.

source: See the L<fields> pragma for more information.
es: Vea la documentación del pragma L<fields> para obtener más información.

source: See the L<mro> documentation for more details on this feature.
es: Consulte la documentación de L<mro> para conocer más detalles sobre esta característica.

source: See the L<opendir|perlfunc/opendir> function.
es: Vea la función L<opendir|perlfunc/opendir>.

source: See the L<perlgit> for details on how to do this.
es: Encontrará más información en L<perlgit>.

source: See the L<umask|perlfunc/umask> function.
es: Vea la función L<umask|perlfunc/umask>.

source: See the L<use|perlfunc/use> built-in.
es: Vea la función predefinida L<use|perlfunc/use>.

source: See the answer to "Where can I buy a commercial version of perl?" for more information.
es: Vea la respuesta a la pregunta "¿Dónde puedo adquirir una versión comercial de Perl?" para obtener más información.

source: See the bottom of L<perlfunc/open> for an example.
es: Encontrará un ejemplo al final de la sección "open" de L<perlfunc>.

source: See the explanation for the C<(*MARK:NAME)> verb below for more details.
es: Vea abajo la descripción del verbo C<(*MARK:NOMBRE)> para obtener más información.

source: See the file I<perly.y> in the Perl source distribution.
es: Vea el archivo I<perly.y> de la distribución de código fuente de Perl.

source: See the independent subexpression L</C<< (?>pattern) >>> for more details; possessive quantifiers are just syntactic sugar for that construct.
es: Vea la subexpresión independiente L</C<< (?>patrón) >>> para obtener más detalles; los cuantificadores posesivos no son más que una simplificación sintáctica de esta construcción.

source: See the list of operators in the next section for information on comparison and boolean logic operators, which are commonly used in conditional statements.
es: Consulte la lista de operadores de la siguiente sección para obtener información sobre los operadores lógicos booleanos y de comparación que se suelen usar en instrucciones condicionales.

source: See the next section for how to configure and use git to send these emails for you.
es: En la siguiente sección aprenderá a configurar y usar git para que envíe automáticamente estos mensajes de correo electrónico.

source: Semicolon omitted in "short" one-line BLOCK.
es: Punto y coma omitido en BLOQUE "pequeño" de una sola línea.

source: Sequence Note Description
es: Secuencia Nota Descripción

source: Setuid scripts have additional constraints that can produce error messages such as "Insecure dependency".
es: Los scripts setuid tienen restricciones adicionales que pueden producir mensajes de error como "Insecure dependency" (dependencia insegura).

source: Several special variables also refer back to portions of the previous match.
es: También se pueden usar varias variables especiales para hacer referencia a partes de la coincidencia anterior.

source: Several unix/linux releated magazines frequently includes articles on Perl.
es: Diversas revistas dedicadas a unix/linux incluyen frecuentemente artículos sobre Perl.

source: SharedGreatGrandParent / \
es: BisabueloComún / \

source: Shells can also execute scripts containing such commands.
es: Una shell también puede ejecutar scripts que contienen estos comandos.

source: Short for "an instance of a class", meaning an L</object> of that L</class>.
es: Abreviatura de "instancia de una clase", es decir, un L</objeto> de esa L</clase>.

source: Short for "array value", which refers to one of Perl's internal data types that holds an L</array>.
es: Abreviatura de "array value" (valor de array), que hace referencia a uno de los tipos de datos internos de Perl que contiene un L</array>.

source: Short for "scalar value".
es: Abreviatura de "scalar value" (valor escalar).

source: Short for L</scratchpad>.
es: Abreviatura de L</bloc de notas>.

source: Short for Nevada, no part of which will ever be confused with civilization.
es: Abreviatura de Nevada, un lugar donde no hay ni rastro de civilización.

source: Short for Perl Monger, a purveyor of Perl.
es: Abreviatura de Perl Monger, un proveedor de servicios basados en Perl.

source: Short for Transmission Control Protocol.
es: Abreviatura de Protocolo de control de transmisión.

source: Short for a "hash value" typedef, which holds Perl's internal representation of a hash.
es: Abreviatura de la definición de tipo "hash value" (valor de hash), que contiene la representación interna en Perl de un hash.

source: Short for a "terminal", that is, a leaf node of a L</syntax tree>.
es: Nodo hoja de un L</árbol de sintaxis>.

source: Shortening an array this way destroys intervening values.
es: Acortar un array de esta forma destruye los valores involucrados.

source: Similar for two matches for C<T>.
es: Y es similar para las dos coincidencias de C<T>.

source: Similar in many ways to the prescription-only medication called "System V", but infinitely more useful.
es: Es similar en muchos aspectos al medicamento "System V", que solo se puede obtener con receta, pero infinitamente más útil.

source: Similar in spirit to C<(?{0})> but more efficient.
es: Es similar a C<(?{0})>, pero más eficiente.

source: Similar to C<(??{ code })> except it does not involve compiling any code, instead it treats the contents of a capture group as an independent pattern that must match at the current position.
es: Similar a C<(??{ código })>, salvo que no incluye la compilación de código; en su lugar, trata el contenido de un grupo de captura como un patrón independiente que debe coincidir en la posición actual.

source: Similar to C<(R1)>, this predicate checks to see if we're executing directly inside of the leftmost group with a given name (this is the same logic used by C<(?&NAME)> to disambiguate).
es: De manera similar a C<(R1)>, este predicado comprueba si la ejecución se realiza directamente dentro del grupo con nombre más a la izquierda (es la misma lógica usada por C<(?&NOMBRE)> para eliminar la ambigüedad).

source: Similar to numeric backreferences, except that the group is designated by name and not number.
es: Son similares a las retrorreferencias numéricas, con la diferencia de que el grupo se designa por nombre, no por número.

source: Similarly the NULL needs to be taken into account when you are considering the length of existing keys/values.
es: También hay que tener en cuenta el carácter NULL al determinar la longitud de claves y valores existentes.

source: Similarly, interpolating an array with no elements is the same as if no array had been interpolated at that point.
es: Del mismo modo, interpolar un array sin elementos produce el mismo resultado que no interpolar ningún array.

source: Similarly, C<(?:...)> can't have a space between the C<?> and C<:>, but can between the C<(> and C<?>.
es: De forma similar, en C<(?:...)> no puede haber ningún espacio entre C<?> y C<:>, pero sí puede haber espacios entre C<(> y C<?>.

source: Similarly, F<s2p> converts F<sed> scripts to Perl programs.
es: De manera similar, F<s2p> convierte scripts F<sed> en programas Perl.

source: Similarly, Perl's built-in C<ref> function treats a reference to a blessed object specially.
es: De forma análoga, la función predefinida C<ref> trata de forma especial las referencias a objetos bendecidos.

source: Similarly, \xI<nn>, where I<nn> are hexadecimal digits, matches the character whose ordinal is I<nn>.
es: Del mismo modo, \xI<nn>, donde I<nn> son dígitos hexadecimales, detecta el carácter cuyo ordinal es I<nn>.

source: Similarly, all the characters that are decimal digits somewhere in the world will match C<\d>; this is hundreds, not 10, possible matches.
es: Del mismo modo, C<\d> detectará todos los caracteres que son dígitos decimales en algún lugar del mundo; esto supone detectar cientos de posibles coincidencias, no diez.

source: Similarly, decimal strings can represent only those numbers which have a finite decimal expansion.
es: De manera similar, las cadenas decimales solo pueden representar números que tengan una expansión decimal finita.

source: Similarly, don't create patches for files under $src_root/ext from their copies found in $install_root/lib.
es: Por la misma razón, no debe crear parches para archivos de $src_root/ext a partir de las copias que se encuentran en $install_root/lib.

source: Similarly, for repeated C<m/()/g> the second-best match is the match at the position one notch further in the string.
es: Del mismo modo, para construcciones C<m/()/g> repetidas, la segunda mejor coincidencia es la coincidencia en la posición situada un carácter más allá en la cadena.

source: Similarly, it would be better to use C<use feature 'unicode_strings'> instead of,
es: De manera similar, es mejor utilizar C<use feature 'unicode_strings'> en lugar de

source: Similarly, just because an operator lets you assume default arguments doesn't mean that you have to make use of the defaults.
es: Que un operador permita asumir argumentos predeterminados no significa que haya que hacer uso de esos valores predeterminados.

source: Similarly, looking at variables stored in a private dictionary (namespace) for each scope, which are visible only from their point of declaration down to the end of the lexical scope in which they are declared.
es: De forma similar, significa mirar variables almacenadas en un diccionario (espacio de nombres) privado para cada ámbito, de forma que solo son visibles desde su punto de declaración hasta el final del ámbito léxico en que se declararon.

source: Similarly, the formal arguments to a Perl subroutine are C<$_[0]>, C<$_[1]>, and so on.
es: De manera similar, los argumentos formales de una subrutina Perl son C<$_[0]>, C<$_[1]>, etc.

source: Similarly, to allow for future expansion, the return value should be a single C<0> or C<1> value.
es: De forma análoga, y teniendo en cuenta posibles ampliaciones futuras, el valor devuelto debería ser un solo valor C<0> ó C<1>.

source: Similarly, when invoking a L</method>, you might place the invocant between the method and its arguments:
es: De manera similar, al invocar un L</método> puede colocar el invocante entre el método y sus argumentos:

source: Simple, one-off commits pushed to the 'blead' branch should be simple commits that apply cleanly.
es: Las confirmaciones puntuales sencillas enviadas a la rama "blead" deben ser simples y aplicarse limpiamente.

source: Simply quote all non-"word" characters:
es: Para marcar con un carácter de escape todos los caracteres que no sean de tipo "palabra":

source: Since 5.6.0, Perl has had support for a new type of threads called interpreter threads (ithreads).
es: En la versión 5.6.0 de Perl se agregó compatibilidad con un nuevo tipo de hilos de ejecución, denominado hilos de ejecución de intérprete (I<ithreads>).

source: Since Perl programs are (typically) simple text files, not executable images, a Perl program is much less sensitive to the architecture it's running on than programs in other languages, such as C, that are compiled into machine code.
es: Como los programas Perl son (normalmente) archivos de texto simple, no imágenes ejecutables, un programa Perl es mucho menos sensible a la arquitectura en la que se ejecuta que los programas escritos en otros lenguajes (como C) que se compilan a código máquina.

source: Since changing a slice changes the original array or hash that it's slicing, a C<foreach> construct will alter some--or even all--of the values of the array or hash.
es: Como al modificar una porción se modifica el array o hash original, una construcción C<foreach> modificará algunos (o incluso todos) los valores del array o hash.

source: Since the 5.000 release, we have averaged only about one production release per year.
es: Desde el lanzamiento de la versión 5.000 no hemos lanzado más de una versión de producción al año (en promedio).

source: Since the object is also a hash, you can treat it as one, using it to store data associated with the object.
es: Como el objeto también es un hash, puede tratarlo como tal, usándolo para almacenar datos asociados con el objeto.

source: Since this is a global, if you want to refer to do it without a package name prefix under C<strict 'vars'>, you need to declare it.
es: Como se trata de una variable global, si desea hacer referencia a la misma sin un prefijo de nombre de paquete mediante C<strict 'vars'>, debe declararla.

source: Since undefined values evaluate to C<"">, all undefined values are false (including the L</null list>), but not all false values are undefined.
es: Puesto que los valores indefinidos se evalúan como C<"">, todos los valores indefinidos son falsos (incluida la L</lista nula>), pero no todos los valores falsos son indefinidos.

source: Since we didn't define a C<save()> method in the C class, Perl will look at the C class's parent classes to find the C<save()> method.
es: Como no se ha definido el método C<guardar()> en la clase C, Perl lo buscará en las clases primarias de la clase C.

source: Since we're going to be altering this file, let's copy it to F<pp.c~>.
es: Puesto que vamos a modificar este archivo, antes creamos una copia y le asignamos el nombre F<pp.c~>.

source: Since you can assign to a list of variables, you can also assign to an array or hash slice.
es: Como podemos asignar a una lista de variables, también podemos a una porción de array o de hash.

source: Six such conversions are possible:
es: Hay seis conversiones posibles:

source: Skip the real Pod formatting, and just show the raw Pod source (B<U>nformatted)
es: Omite el formato pod real y solo muestra el código pod sin formato ("u" viene de la palabra inglesa B<U>nformatted)

source: Slices in scalar context return the last item of the slice.
es: En contexto de escalar, las porciones devuelven el último elemento de la porción.

source: So
es: Así que

source: So something like this:
es: De forma que el código siguiente:

source: So "perldoc intro" is enough to find/render "perlintro.pod".
es: Por ejemplo, "perldoc intro" es suficiente para encontrar y mostrar "perlintro.pod".

source: So C<< ((?>a*)|(?>b*))ar >> will still match "bar".
es: Por tanto C<< ((?>a*)|(?>b*))ar >> aún coincidirá con "bar".

source: So C<my $logmessage = shift;> shifts the first item off the list of arguments and assigns it to C<$logmessage>.
es: Así, C<my $mensaje_registro = shift;> quita el primer elemento de la lista de argumentos y se lo asigna a C<$mensaje_registro>.

source: So anything that looks like \\, \(, \), \<, \>, \{, or \} is always interpreted as a literal character, not a metacharacter.
es: Así, cosas como \\, \(, \), \<, \>, \{ o \} siempre deben interpretarse como caracteres literales, no como metacaracteres.

source: So avoid C<$&>, C<$'>, and C<$`> if you can, but if you can't (and some algorithms really appreciate them), once you've used them once, use them at will, because you've already paid the price.
es: Por tanto, es recomendable evitar el uso de C<$&>, C<$'> y C<$`>, pero si no es posible (para algunos algoritmos su uso es inevitable), una vez usados ya ha pagado el precio, por lo que podrá seguir usándolos a voluntad.

source: So by storing a reference as the value of an array or hash element, you can easily create lists and hashes within lists and hashes.
es: Así, almacenando una referencia como el valor de un elemento de array o hash, puede crear fácilmente listas y hashes dentro de listas y hashes.

source: So called because of a similar construct in L<shells|/shell> that pretends that the L<lines|/line> following the L</command> are a separate L</file> to be fed to the command, up to some terminating string.
es: Del inglés I<here document>. Se llama así por una construcción similar de las L<shells|/shell> que simula que las L<líneas|/línea> que siguen al L</comando>, hasta una cadena de terminación, son un L</archivo> independiente que se debe pasar al comando.

source: So far I've merely tried to find and list the experimental features and infer their inception, versions, etc.
es: De momento solo hemos intentado recopilar las funcionalidades experimentales y establecer su origen, versiones, etc.

source: So given the diagram above, Perl will search C<Child>, C<Father>, C<PaternalGrandparent>, C<SharedGreatGrandParent>, C<Mother>, and finally C<MaternalGrandparent>.
es: Así, dado el diagrama anterior, Perl buscará siguiendo el orden C<Hijo>, C<Padre>, C<AbueloPaterno>, C<BisabueloComún>, C<Madre> y, por último, C<AbueloMaterno>.

source: So hopefully you've now got a few ideas about what's good to modularise.
es: Ya sabe qué partes podría convertir en módulos.

source: So if the beginning of a pattern containing a quantifier succeeds in a way that causes later parts in the pattern to fail, the matching engine backs up and recalculates the beginning part--that's why it's called backtracking.
es: Así, si el principio de un patrón que contiene un cuantificador coincide de manera que partes posteriores del patrón no coincidan, el motor retrocede y recalcula la parte inicial. Por esto se denomina vuelta atrás.

source: So now you have a file ending in .tar.gz (or, less often, .zip).
es: Así pues, ahora tiene un archivo con la extensión .tar.gz (o .zip, aunque esto es menos frecuente).

source: So rewriting this way produces what you'd expect; that is, case 5 will fail, but case 6 succeeds:
es: Si reescribimos el código anterior de esta manera se obtiene el resultado esperado. Es decir, no habrá coincidencia en el caso 5 pero sí la habrá en el caso 6:

# So this is the end of the tale. " }
source: So this is the end of the tale.\n" }
es: Y este cuento se ha acabado.\n" }

# So this is the sixth line. " }
source: So this is the sixth line.\n" }
es: Esta es la sexta línea.\n" }

# So this line comes out second. " }
source: So this line comes out second.\n" }
es: Así que esta línea será la segunda.\n" }

source: So when you use this:
es: Así, cuando se ejecuta la siguiente instrucción:

source: So you can't execute any of these code blocks by name.
es: Por esta razón no puede ejecutar ninguno de estos bloques usando su nombre.

source: So you write this:
es: Podemos probar con:

source: So, here's where C<pat> is set up:
es: Aquí es donde se establece C<pat>:

source: Some modules generate Makefiles that work better with GNU make, which is available from http://www.mks.com/s390/gnu/
es: Los archivos Makefile generados por algunos módulos funcionan mejor con GNU make, que está disponible en http://www.mks.com/s390/gnu/

source: Some objects are more accommodating than others.
es: Algunos objetos son más complacientes que otros.

source: Some L<operating systems|/operating system> call these "folders", "drawers", or "catalogs".
es: Algunos L<sistemas operativos|/sistema operativo> llaman a estos archivos "carpetas", "cajones" o "catálogos".

source: Some brief examples:
es: Algunos ejemplos breves:

source: Some comparison documents can be found at http://www.perl.com/doc/FMTEYEWTK/versus/ if you really can't stop yourself.
es: Si no puede contener su curiosidad, en http://www.perl.com/doc/FMTEYEWTK/versus/ encontrará algunos documentos con comparaciones.

source: Some database drivers for DBI can also automatically encode and decode, but that is sometimes limited to the UTF-8 encoding.
es: Algunos controladores de base de datos para DBI también pueden codificar y descodificar automáticamente, pero a veces esta funcionalidad está limitada a la codificación UTF-8.

source: Some encodings, like the C ("latin") range, do not support the full Unicode standard; characters that can't be represented are lost in the conversion.
es: Algunas codificaciones, como las de la familia C ("alfabeto latino"), no cubren el estándar Unicode completo; los caracteres que no se pueden representar se perderán durante la conversión.

source: Some files have special properties, like directories and devices.
es: Algunos archivos, como los directorios y los dispositivos, tienen propiedades especiales.

source: Some have been part of the core language for many years.
es: Algunas forman parte del núcleo del lenguaje desde hace muchos años.

source: Some languages work directly with the memory addresses of values, but this can be like playing with fire.
es: Algunos lenguajes usan directamente las direcciones de memoria de los valores, pero esto puede ser jugar con fuego.

source: Some modules might have special reporting requirements, such as a Github or Google Code tracking system, so you should check the module documentation too.
es: Es posible que algunos módulos tengan requisitos de notificación específicos, como usar un sistema de seguimiento de errores de Github o Google Code, por lo que es recomendable consultar también la documentación de los módulos.

source: Some of the most interesting features have shown up in the latest versions of Perl 5, and some Perl 5 modules allow you to use some Perl 6 syntax in your programs.
es: Algunas de las características más interesantes de Perl 6 se han incluido en las versiones más recientes de Perl 5, y algunos módulos de Perl 5 le permiten usar la sintaxis de Perl 6 en sus programas.
